---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotDuplicateType
source: html/1c750fc9-d86f-1a2f-a7df-d55ac95d1cad.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotDuplicateType Property

Cannot Duplicate Type.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotDuplicateType { get; }
```